{
    "version": "https://jsonfeed.org/version/1",
    "title": "Buck's Blog",
    "home_page_url": "https://buckubel.github.io/",
    "feed_url": "https://buckubel.github.io/rss/feed.json",
    "description": "Welcome to my blog!",
    "icon": "https://buckubel.github.io/logo512.png",
    "author": {
        "name": "Buck Ubel",
        "url": "https://twitter.com/BuckUbel"
    },
    "items": [
        {
            "id": 0,
            "content_html": "<p>Ich denke ich habe hier noch einiges zu verbessern, aber wenn man nicht anfängt wo kommt man dahin.</p>\n\n<p>Nun worum soll es hier auf der Seite eigentlich gehen? Das ist mir selbst noch gar nicht so klar. Jedenfalls wollte ich eine Plattform für mich finden, auf welcher ich meine Gedanken äußern kann. Da dies eine Github-Page ist, werde ich auch nie erfahren ob jemand überhaupt diese Seiten liest. Höchstens durch Nutzung einer meiner Kontaktmöglichkeiten würde ich dies bemerken.</p>\n\n<p>Es gibt auf dieser Seite zum Einen, die Blog-Seite und zum Anderen die Projekt-Seite. In den Blogs werde ich wohl ein wenig über meine Projekte reden. So trenne ich die Theorie und Praxis voneinander.</p>\n\n<p>Die bisherigen Projekte bisher sind noch recht karg. Es gibt den Namens-Bewerter und Advent of Code.</p>\n\n<p>Ersteres rechnet nur Zahlen zu einander, welche von Buchstaben abhängen. Das auch noch in einem eigenem Input-Feld was eigentlich komplett unnötig ist und nicht mal mobil-fähig ist. Aber gut.</p>\n\n<p>Das Zweitere war mir nach dem vierten Tag zu zeitintensiv, so dass ich das Projekt relativ früh abgebrochen habe.</p>\n\n<p>So was wird das nächste Projekt sein, welches ich in diesem Rahmen veröffentlichen werde?</p>\n\n<p>Ich bin ein recht großer Sammler. Und was sammle ich? Vorrangig Videospiele und Filme. Ersteres aktiver als zweiteres. Aber beides doch so ernst, dass ich so langsam den Überblick verliere.</p>\n\n<h3>So kommen wir zu meiner User-Story:</h3>\n\n<p>Ich möchte ein Tool haben, in welchem ich meine Videospiele und Medien auflisten kann und mir ebenfalls dazu Gedanken aufschreiben kann und sie für mich persönlich bewerben kann.\nIn diesem Tool will ich weiterhin auch noch solche Medien abspeichern welche erst in Zukunft in meine Sammlung kommen sollen.</p>\n\n<p>Die Speicherung soll als JSON gespeichert werden, welches im localStorage gespeichert wird. So brauchen wir hier keinen extra Server und können alles schön extern handeln.</p>\n\n<p>Weiterhin werde ich auch dieses Seite immer weiter verbessern. Diesen Blogeintrag grade, schreibe ich bisher als einfachen String mit enthaltenen \\n. Das ist natürlich relativ einschränkend. Fettdruck, Überschriften, Bilder, ... all das ist so nicht einfach möglich.\nDie Lösung wird dafür sein, den Blog entweder gleich in JSX zu schreiben, oder mit einem Markdown-Plugin zu arbeiten. Wir werden es sehen wohin die Reise hingeht.</p>\n\n<p>Aber zuerst will ich mich nun um mein Tool kümmern. Also wir lesen uns später...</p>",
            "url": "https://buckubel.github.io/blog/0",
            "title": "Endlich fängt es jetzt an...",
            "summary": "Mein erster Blogeintrag! Vielleicht ist er ja interessant für Dich!",
            "date_modified": "2021-05-20T00:00:00.000Z",
            "author": {
                "name": "Buck Ubel",
                "url": "https://twitter.com/BuckUbel"
            },
            "tags": [
                "Start",
                "Neues Projekt"
            ]
        },
        {
            "id": 1,
            "content_html": "<hr/>\n\n<h3>Mein Blog</h3>\n\n<p>Es ist nun etwas länger her, dass ich meinen letzten Blog-Eintrag geschrieben habe.\nAber ich habe die Zeit genutzt und habe die Möglichkeiten des Blogs erweitert.</p>\n\n<p>Mein erster Schritt war die Blogs von Strings auf Markdown-Dateien umzustellen. Da man mit einer Standard-Create-React-App leider keine anderen Dateien \naußerhalb von CSS, HTML, JS und Bildern importieren kann, musste ich mir etwas anderes einfallen lassen. \nDaher speichere ich mir eine Liste mit allen Blog-Dateien und lade sie über fetch gegebenenfalls nach.\nLeider bin ich so darauf angewiesen bei jedem neuen Blog-Eintrag auch jene Liste anzupassen.</p>\n\n<p>Der nächste Schritt war dann richtige Feed-Dateien zum Abonnieren zu erstellen. \nDie von mir gefundene Bibliothek ermöglicht mir neben einen üblichen XML-Export auch einen in JSON Form.\nIch kenne wohl bislang keine Anwendung, welche diese nutzt, aber ich denke gerade als API ist es das sinnigere Format.</p>\n\n<p>Ich weiß noch nicht an welche Stelle ich die Links ablegen möchte, für die Interessierten jedoch sind die beiden Links hier:</p>\n\n<ul><li><a href=\"https://buckubel.github.io/rss/feed.xml\">XML-Feed</a></li><li><a href=\"https://buckubel.github.io/rss/feed.json\">JSON-Feed</a></li></ul>\n\n<p>Die benutzte <a href=\"https://www.npmjs.com/package/feed\">Bibliothek &quot;feed&quot;</a> ist jedenfalls extrem praktisch.\nZuerst lese ich mir alle Dateien aus meinem &quot;Blogs&quot; Ordner nacheinander ein. Dann kann ich die Texte der einzelnen Dateien einlesen und auswerten.\nUm mir beispielsweise das Erstell-Datum des einzelnen Eintrages herauszufinden, gebe ich oben eine Konstante ein und danach das Datum. Das erkennt meine Konverter und gibt der Bibliothek das Datum mit.</p>\n\n<p>Am Ende jedenfalls erstelle ich einzelne <code>items</code> für den Feed, \nwelcher mir verschieden Funktionen zur Verfügung stellt für die jeweilige Feed-Datei. Deren Inhalt erhalte ich dann als String und kann sie normal als Datei wegspeichern.</p>\n\n<p>Ich bin jedenfalls von der Einfachheit dieser Bibliothek begeistert.</p>\n\n<p>Mir fällt auch gerade beim Schreiben dieses Bloges ein, dass ich meine oben beschrieben Liste an Blog-Einträgen auch einfach mit der JSON-Feed Datei ersetzen kann.\nAm Ende ist da nur der Unterschied, dass ich die Blogs, nicht mehr einzeln laden kann wie bisher. Aber ich denke die paar Buchstaben mehr sollten erstmal zu keinem Problem führen.\nAber vielleicht haben <strong>Sie</strong>, werter Leser, ja eine Idee, wie ich das besser lösen könnte. Ich wäre auf ihre Lösungsmöglichkeit gespannt.</p>\n\n<p>Eine Kleinigkeit ist noch erwähnenswert. <strong>Bilder</strong></p>\n\n<p>Die Sache ist die, Bilder sind auf Webseiten ja nichts anderes als Links zu den entsprechenden wirklichen Bildern. Um nun ein Bild in diesen Blog einzubinden, schreibe ich eine solche Zeile:</p>\n\n<blockquote><p><code>![Testbild](/images/blog1_testImage.png)</code></p></blockquote>\n\n<p>Leider kann ein normaler Markdown-Editor nicht die Relation zum richtigen Ordner ziehen. Dieser müsste wie folgt aussehen:</p>\n\n<blockquote><p><code>![Testbild](https://buckubel.github.io/images/blog1_testImage.png)</code></p><p><code>![Testbild](../images/blog1_testImage.png)</code></p></blockquote>\n\n<p>Ersteres wäre komplett okay, wenn ich nicht auch noch lokal meine Entwicklung laufen lassen würde - und zweiteres versteht der Browser nicht.\nAlso hab ich den Fall, dass immer eine Quelle, die Bilder nicht anzeigen kann. \nIch hab mich jedpch dafür entschieden bei der relativen URL zu bleiben.</p>\n\n<p>Der letzte Punkte der bei den Blogs noch zu erledigen ist, sind die Kategorien. Es gibt wohl bereits, welche auf der Webseite jedoch werden diese nicht weiter verwendet.\nIch kann mir gut vorstellen, dass ich diese irgendwann als kleine Tags anklickbar mache, so dass man auf eine darauf gefilterte Liste kommt. Aber da habe ich noch Zeit bis es überhaupt was zu filtern gibt :D</p>\n\n<hr/>\n\n<h3>MediaMaster</h3>\n\n<p>Mein anderes großes Thema war ja der MediaMaster. Und ja, ich habe ihn angefangen.\nJedoch muss ich gestehen, dass ich nach 8 Stunden Arbeit in der Webentwicklung meinen Kopf für so etwas meist nicht frei habe.\nDas ist zwar schade, aber einige Fortschritte habe ich ja gemacht. \nIch hab die Datenstruktur vorbereitet und auch schon die Listen-Ansicht für Spiele angefangen.\nIch muss zugeben, es ist alles prototypisch und muss noch sehr erweitert werden - aber für einen einfachen Überblick würde das schon mal ausreichen.</p>\n\n<p>Der nächste große Punkt wäre dann ein Erstell- und Bearbeitungs-Formular. Damit habe ich auch schon angefangen - aber nach ein paar Stunden fehlte mir dort irgendwie die Motivation.\nDer Vorteil ist jedoch, wenn ich das nächste Mal anfangen möchte, muss ich nur weitere Formularfelder erstellen, der größte Teil der Architektur ist schon vorbereitet und einsatzbereit.</p>\n\n<p>Ihr seht, es ist noch viel zu tun an dem Punkt.</p>\n\n<hr/>\n\n<h3>Was ist noch so los ?</h3>\n\n<p>Ich habe in letzter Zeit ein wenig meine kreative Ader ausgelebt und habe mich mit Pixel-Art angefreundet.\nDabei hab ich bemerkt, dass viele kostenlose Grafiktools etwaige Schwächen haben für meine Herangehensweisen.</p>\n\n<p>Viele Graphik-Tools sind halt auch nicht dafür gedacht, sondern haben eher den Anspruch richtige Bilder zu verschönern, durch Anpassung an Kontrast, Farbsättigung, etc.</p>\n\n<p>Daher denke ich werd ein paar kleine simple Graphiktools über diese Webseite veröffentlichen. Ich hätte beispielsweise gerne einen kleinen Gifmaker der nicht komplett mit Werbung überladen ist.</p>\n\n<p>Eine Internet-Bekanntschaft von mir hat auch ein cooles <a href=\"https://pixelpalette.webfussel.de\">Graphik-Tool</a> geschrieben, welches PixelArt in einen String komprimiert.\nIch finde die Idee-Klasse. Ich denke ich werde die Idee des Tools übernehmen und erweitern. Ihr könnt gespannt sein, was ich mir noch so ausdenken werde!</p>\n\n<p><code>Und nun führe ich nur einen Befehl auf meinem Projekt aus und schon ist der Blog geupdated ^^</code></p>",
            "url": "https://buckubel.github.io/blog/1",
            "title": "Über Blogs und der MediaMaster",
            "summary": "Der Blog ist fast fertig!",
            "date_modified": "2021-08-10T00:00:00.000Z",
            "author": {
                "name": "Buck Ubel",
                "url": "https://twitter.com/BuckUbel"
            },
            "tags": [
                "Blog",
                "MediaMaster",
                "Neues Projekt"
            ]
        }
    ]
}